Goals_App/app/models/user.rb

  def reset_session_token!
    self.session_token = generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "HVKlvYkFs-ZSRV-x2LEtrQ"], ["updated_at", "2019-04-05 23:49:26.969896"], ["id", 1]]